Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.loop.error.contextUnavailable
source: Starcat could not load the local repository context for this run.
ar: فشل Starcat في تحميل سياق مخزن محلي لهذا التشغيل.
de: Starcat konnte den lokalen Repository-Kontext für diese Ausführung nicht laden.
es: Starcat no pudo cargar el contexto local del repositorio para esta ejecución.
fr: Starcat n'a pas pu charger le contexte du dépôt local pour cette exécution.
id: Starcat tidak dapat memuat konteks repository lokal untuk jalannya ini.
it: Starcat non è riuscito a caricare il contesto del repository locale per questa esecuzione.
ja: Starcat はこの実行のためのローカルリポジトリコンテキストを読み込めませんでした。
ko: Starcat은 현재 실행에 대한 로컬 리포지토리 컨텍스트를 불러올 수 없습니다.
nl: Starcat kon de lokale repository-context niet laden voor deze run.
pl: Starcat nie mógł załadować kontekstu lokalnego repozytorium dla tego uruchomienia.
pt_br: O Starcat não conseguiu carregar o contexto local do repositório para essa execução.
ru: Starcat не смог загрузить локальный контекст репозитория для этого запуска.
tr: Starcat bu çalışma için yerel depoda bağlamı yükleyemedi.
uk: Starcat не вдалося завантажити локальний контекст репозиторію для цього запуску.
vi: Starcat không thể tải kho lưu trữ địa phương cho lần chạy này.
zh_hans: Starcat 无法为本次运行加载本地仓库上下文。
zh_hant: Starcat 無法載入本地倉庫上下文執行此次運行。

# agent.loop.error.emptyModelResponse
source: The Agent model returned neither text nor tool calls.
ar: لم يعيد الوكيل أي نص أو أدوات.
de: Der Agent-Modell hat weder Text noch Tool-Aufrufe zurückgegeben.
es: El modelo del Agente no devolvió texto ni llamadas a herramientas.
fr: Le modèle Agent n'a retourné ni texte ni appels d'outil.
id: Model Agent tidak mengembalikan teks maupun panggilan alat.
it: Il modello Agent non ha restituito né testo né chiamate di strumenti.
ja: Agent モデルはテキストもツール呼び出しも返しませんでした。
ko: Agent 모델이 텍스트 또는 도구 호출을 반환하지 않았습니다.
nl: De Agent-model leverde geen tekst of tool-aanroepen op.
pl: Agent nie zwrócił ani tekstu, ani wywołań narzędzi.
pt_br: O modelo do Agente não retornou texto nem chamadas de ferramenta.
ru: Модель Agent не вернула ни текста, ни вызовов инструментов.
tr: Agent modeli ne metin ne de araç çağrısı döndürmedi.
uk: Модель Agent не повернула ні тексту, ні викликів інструментів.
vi: Agent mô hình trả về cả văn bản và cuộc gọi công cụ.
zh_hans: Agent 模型没有返回文本或工具调用。
zh_hant: 代理人模型未返回任何文字或工具呼叫。

# agent.loop.error.noPendingApproval
source: This Agent run has no pending approval to resume.
ar: لا يوجد موافقة متوقفة لاستئناف هذا تشغيل الوكيل.
de: Diese Agent-Ausführung hat keine ausstehende Genehmigung zur Wiederaufnahme.
es: Esta ejecución de Agente no tiene aprobaciones pendientes para reanudarse.
fr: Cette exécution d'Agent n'a aucune approbation en attente à reprendre.
id: Jalan Agent ini tidak memiliki persetujuan menunggu untuk dilanjutkan.
it: Questa esecuzione dell'Agent non ha approvazioni pendenti da riprendere.
ja: この Agent の実行には承認待ちがありません。
ko: 현재 Agent 실행에는 승인 대기 중인 항목이 없습니다.
nl: Deze Agent-run heeft geen wachtende goedkeuring om te herstarten.
pl: To uruchomienie Agenta nie ma oczekujących zatwierdzeń do wznowienia.
pt_br: Esta execução do Agente não possui aprovação pendente para retomar.
ru: В этом запуске Agent нет ожидающего утверждения для продолжения.
tr: Bu Agent çalışması devam etmek için onay beklemiyor.
uk: Цей запуск Agent не має очікуючих схвалень для відновлення.
vi: Lần chạy Agent này không có phê duyệt chờ để tiếp tục.
zh_hans: 此 Agent 运行没有可恢复的待审批操作。
zh_hant: 此 Agent 執行中無待批准的步驟可繼續。

# agent.loop.error.repositoryContextEmpty
source: This Agent requires at least one repository in the local Starcat knowledge library.
ar: يحتاج هذا الوكيل إلى مخزن على الأقل في مكتبة المعرفة المحلية ل-Starcat.
de: Dieser Agent benötigt mindestens ein Repository in der lokalen Starcat-Wissensbibliothek.
es: Este Agente requiere al menos un repositorio en la biblioteca local de conocimiento de Starcat.
fr: Cet Agent nécessite au moins un dépôt dans la bibliothèque de connaissances locale Starcat.
id: Agent ini memerlukan setidaknya satu repository di perpustakaan pengetahuan lokal Starcat.
it: L'Agent richiede almeno un repository nella libreria conoscenza locale Starcat.
ja: この Agent はローカル Starcat 知識ライブラリに少なくとも1つのリポジトリが必要です。
ko: 이 Agent는 로컬 Starcat 지식 라이브러리에 최소한의 리포지토리가 필요합니다.
nl: Deze Agent vereist ten minste één repository in de lokale Starcat kennisbibliotheek.
pl: Ten Agent wymaga co najmniej jednego repozytorium w lokalnej bibliotece wiedzy Starcat.
pt_br: Este Agente requer pelo menos um repositório na biblioteca de conhecimento local do Starcat.
ru: Этот Agent требует хотя бы один репозиторий в локальной библиотеке знаний Starcat.
tr: Bu Agent yerel Starcat bilgi kütüphanesinde en az bir repo gerektiriyor.
uk: Цей Agent вимагає принаймні один репозиторій у локальній бібліотеці знань Starcat.
vi: Agent cần ít nhất một kho lưu trữ trong thư viện tri thức Starcat địa phương.
zh_hans: 此 Agent 至少需要知识库中存在一个本地仓库。
zh_hant: 此 Agent 需要至少一個本地 Starcat 知識庫倉庫。

# agent.loop.error.requiredArtifactMissing
source: The Agent ended before creating the required artifact.
ar: انتهى الوكيل قبل إنشاء المادة المطلوبة.
de: Der Agent beendete die Ausführung, ohne das erforderliche Artifact zu erstellen.
es: El Agente terminó sin crear el artefacto requerido.
fr: L'Agent s'est terminé sans créer l'artéfact requis.
id: Agent berakhir sebelum menciptakan artefak yang diperlukan.
it: L'Agent si è concluso senza creare l'articolo/oggetto richiesto.
ja: Agent が必要なアーティファクトを作成する前に終了しました。
ko: Agent가 필요한 아티팩트를 생성하기 전에 종료되었습니다.
nl: De Agent eindigde zonder het vereiste artefact te creëren.
pl: Agent zakończył działanie bez utworzenia wymaganego artykułu (pliku).
pt_br: O Agente terminou sem criar o artefato necessário.
ru: Agent завершился без создания необходимого артефакта.
tr: Agent gerekli sanat eseri oluşturmadan sona erdi.
uk: Agent завершився без створення необхідного артефакту.
vi: Agent kết thúc trước khi tạo tài liệu kỹ thuật yêu cầu.
zh_hans: Agent 在创建必需产出物前结束了运行。
zh_hant: 代理人在創建所需工件前已結束。

# agent.loop.error.resumeUnavailable
source: The current Agent runtime cannot resume a pending run.
ar: لا يمكن لاستدارة الوكيل الحالية استئناف تشغيل متوقف.
de: Die aktuelle Agent-Laufzeit kann keine ausstehende Ausführung wieder aufnehmen.
es: La ejecución actual del Agente no puede reanudar una ejecución pendiente.
fr: Le runtime actuel de l'Agent ne peut pas reprendre une exécution en attente.
id: Runtime Agent saat ini tidak dapat melanjutkan jalannya yang menunggu.
it: Il runtime attuale dell'Agent non può riprendere una esecuzione pendente.
ja: 現在の Agent ランタイムは承認待ち実行を再開できません。
ko: 현재 Agent 런타임은 대기 중인 실행을 재개할 수 없습니다.
nl: De huidige Agent-runtime kan een wachtende run niet herstarten.
pl: Obecny runtime Agenta nie może wznowić oczekującego uruchomienia.
pt_br: O runtime atual do Agente não pode retomar uma execução pendente.
ru: Текущая среда выполнения Agent не может продолжить ожидающий запуск.
tr: Mevcut Agent çalışma zamanı bekleyen bir çalışmayı devam ettiremiyor.
uk: Поточний runtime Agent не може відновити очікуючий запуск.
vi: Thời gian chạy Agent hiện tại không thể tiếp tục lần chạy chờ.
zh_hans: 当前 Agent Runtime 无法恢复待审批运行。
zh_hant: 目前的 Agent 執行環境無法繼續待批准的執行。

# agent.loop.error.retryUnavailable
source: This Agent run cannot be retried safely from its saved state.
ar: لا يمكن إعادة محاولة تشغيل الوكيل هذا بأمان من حالته المحفوظة.
de: Dieser Agent-Lauf kann aus seinem gespeicherten Zustand nicht sicher erneut versucht werden.
es: Esta ejecución del Agente no se puede reintentar de forma segura desde su estado guardado.
fr: Cette exécution de l’Agent ne peut pas être relancée en toute sécurité depuis son état enregistré.
id: Proses Agent ini tidak dapat dicoba lagi dengan aman dari status tersimpannya.
it: Questa esecuzione dell’Agent non può essere ritentata in sicurezza dallo stato salvato.
ja: この Agent 実行は保存された状態から安全に再試行できません。
ko: 이 Agent 실행은 저장된 상태에서 안전하게 다시 시도할 수 없습니다.
nl: Deze Agent-run kan niet veilig opnieuw worden geprobeerd vanuit de opgeslagen status.
pl: Tego uruchomienia Agenta nie można bezpiecznie ponowić z zapisanego stanu.
pt_br: Esta execução do Agente não pode ser tentada novamente com segurança a partir do estado salvo.
ru: Этот запуск Agent нельзя безопасно повторить из сохранённого состояния.
tr: Bu Agent çalışması kaydedilmiş durumundan güvenli şekilde yeniden denenemez.
uk: Цей запуск Agent не можна безпечно повторити зі збереженого стану.
vi: Lần chạy Agent này không thể được thử lại an toàn từ trạng thái đã lưu.
zh_hans: 此 Agent 运行无法从已保存状态安全重试。
zh_hant: 此 Agent 執行無法從已儲存狀態安全重試。

# agent.loop.error.toolNotVisibleFormat
source: Tool %@ is not available to this Agent in the current execution mode.
ar: أداة `%@` غير متاحة لهذا الوكيل في وضع التنفيذ الحالي.
de: Das Tool %@ ist für diesen Agenten in der aktuellen Ausführungsmodus nicht verfügbar.
es: La herramienta %@ no está disponible para este Agente en el modo de ejecución actual.
fr: L'outil %@ n'est pas disponible pour cet Agent dans le mode d'exécution courant.
id: Alat %@ tidak tersedia untuk Agent dalam mode eksekusi saat ini.
it: Lo strumento %@ non è disponibile per questo Agent nel modo di esecuzione corrente.
ja: ツール %@ は現在の実行モードではこの Agent に利用できません。
ko: 도구 %@는 현재 실행 모드에서 이 Agent에게 사용할 수 없습니다.
nl: Tool %@ is niet beschikbaar voor deze Agent in de huidige uitvoeringsmodus.
pl: Narzędzie %@ nie jest dostępne dla tego Agenta w obecnym trybie wykonania.
pt_br: A ferramenta %@ não está disponível para este Agente no modo de execução atual.
ru: Инструмент %@ недоступен для этого Agent в текущем режиме выполнения.
tr: Araç %@ bu Agent'in mevcut yürütme modunda görünmüyor.
uk: Інструмент %@ недоступний для цього Agent у поточному режимі виконання.
vi: Công cụ %@ không khả dụng cho Agent trong chế độ thực thi hiện tại.
zh_hans: 工具 %@ 在当前 Agent 与执行模式下不可用。
zh_hant: 工具 %@ 在當前執行模式下對此 Agent 不可用。

# agent.loop.error.toolTimeoutFormat
source: Tool %@ timed out.
ar: أخطاء الأداة: تجاوز وقت الاستجابة للأداة %@.
de: Werkzeug %@ ist abgelaufen.
es: Herramienta %@ expiró el tiempo de espera.
fr: Outil %@ a dépassé le délai d'attente.
id: Alat %@ melewati batas waktu.
it: Strumento %@ scaduto.
ja: ツール %@ がタイムアウトしました。
ko: 도구 %@가 타임아웃되었습니다.
nl: Gereedschap %@ is getime-out.
pl: Narzędzie %@ wygasło czasu oczekiwania.
pt_br: Ferramenta %@ expirou o tempo limite.
ru: Инструмент %@ завершил работу за пределами времени ожидания.
tr: Araç %@ zaman aşımına uğradı.
uk: Інструмент %@ перевищив час очікування.
vi: Công cụ %@ đã hết thời gian chờ.
zh_hans: 工具 %@ 执行超时。
zh_hant: 工具 %@ 超時。

# agent.message.error.duplicateToolCallFormat
source: Duplicate Agent tool-call ID: %@.
ar: تكرار معرف استدعاء أداة الوكيل: %@.
de: Duplizierter Agent-Werkzeugaufruf-ID: %@.
es: ID duplicado de llamada de Herramienta del Agente: %@.
fr: ID d'appel d'Agent dupliqué : %@.
id: ID panggilan alat Agent duplikasi: %@.
it: ID chiamata strumento duplicato dell'Agent: %@.
ja: 重複するエージェント・ツールコール ID: %@。
ko: 중복된 Agent 도구 호출 ID: %@.
nl: Dubbel Agent gereedschapsoproep-ID: %@.
pl: Powtórzone IDwołania narzędzia Agent: %@.
pt_br: ID de chamada da ferramenta do Agente duplicado: %@.
ru: Повторяющийся ID вызова инструмента Agent: %@.
tr: Çakışan Agent araç çağrı ID'si: %@.
uk: Дубль ідентифікатора виклику інструменту Ейджента: %@.
vi: ID gọi công cụ Agent trùng lặp: %@.
zh_hans: Agent 工具调用 ID 重复：%@。
zh_hant: 重複的 Agent 工具呼叫 ID：%@。

# agent.message.error.duplicateToolResultFormat
source: Duplicate Agent tool result for call ID: %@.
ar: نتيجة تكرارية لاستدعاء أداة الوكيل (معرف: %@).
de: Dupliziertes Ergebnis des Agent-Werkzeugs für Aufruf-ID: %@.
es: Resultado duplicado de herramienta para ID de llamada: %@.
fr: Résultat d'outil Agent dupliqué pour l'ID d'appel : %@.
id: Hasil alat Agent duplikasi untuk ID panggilan: %@.
it: Risultato strumento duplicato per ID chiamata: %@.
ja: ツール結果の重複（コールID: %@）。
ko: 중복된 Agent 도구 결과 (호출 ID: %@).
nl: Dubbele Agent gereedschapsresultaat voor oproep-ID: %@.
pl: Duplikat wyniku narzędzia dla IDwołania: %@.
pt_br: Resultado da ferramenta do Agente duplicado para ID de chamada: %@.
ru: Повторяемый результат работы инструмента для ID вызова: %@.
tr: Tekrar eden Agent araç sonucu (çağrı ID'si): %@.
uk: Дублюючий результат інструменту для ID виклику: %@.
vi: Kết quả công cụ Agent trùng lặp cho ID gọi: %@.
zh_hans: Agent 工具调用 %@ 存在重复结果。
zh_hant: 重複的 Agent 工具結果（呼叫 ID：%@）。

# agent.message.error.invalidMessageFormat
source: Agent message is empty or has an invalid turn: %@.
ar: رسالة الوكيل فارغة أو غير صالحة: %@.
de: Agentennachricht ist leer oder hat einen ungültigen Durchgang: %@.
es: Mensaje del Agente vacío o con formato inválido en el turno: %@.
fr: Message de l'Agent vide ou tour invalide : %@.
id: Pesan Agent kosong atau memiliki format putaran tidak valid: %@.
it: Messaggio Agent vuoto o con formato turno invalido: %@.
ja: エージェントメッセージが空欄または無効なターンです: %@。
ko: Agent 메시지가 비어 있거나 유효하지 않은 턴입니다: %@.
nl: Agent-bericht is leeg of heeft een ongeldige ronde: %@.
pl: Błędne wiadomość Agenta lub nieprawidłowy obrót: %@.
pt_br: Mensagem do Agente está vazia ou possui formato inválido na rodada: %@.
ru: Сообщение Agent пустое или содержит некорректный тур: %@.
tr: Geçersiz Agent mesajı veya geçersiz tur: %@.
uk: Помилка повідомлення Ейджента: порожнє або недійсне коло обертання: %@.
vi: Tin nhắn của Agent rỗng hoặc có cấu trúc lỗi: %@.
zh_hans: Agent 消息为空或轮次无效：%@。
zh_hant: Agent 消息為空或轉數無效：%@。

# agent.message.error.invalidPartForRoleFormat
source: Agent message part is invalid for role %@.
ar: جزء الرسالة غير صالح لدور %@.
de: Ungültiger Teil der Agentennachricht für Rolle %@.
es: Parte del mensaje del Agente inválida para el rol %@.
fr: Partie du message de l'Agent invalide pour le rôle %@.
id: Bagian pesan Agent tidak valid untuk peran %@.
it: Parte del messaggio Agent invalida per ruolo %@.
ja: エージェントメッセージのパートが役割 %@ に不適切です。
ko: Agent 역할에 해당하는 메시지 부분이 유효하지 않습니다: %@.
nl: Ongeldig deel van het Agent-bericht voor rol %@.
pl: Nieprawidłowa część wiadomości dla roli %@.
pt_br: Parte da mensagem do Agente é inválida para o papel %@.
ru: Некорректная часть сообщения для роли %@.
tr: Agent rolü için geçersiz mesaj parçası: %@.
uk: Невідповідна частина повідомлення для ролі %@.
vi: Phần tin nhắn của Agent không hợp lệ cho vai trò %@.
zh_hans: Agent 消息块不适用于角色 %@。
zh_hant: Agent 消息部分不符合角色 %@ 的規範。

# agent.message.error.invalidToolCallFormat
source: Agent tool call has an empty ID or name: %@.
ar: استدعاء أداة الوكيل يحتوي على معرف أو اسم فارغ: %@.
de: Agent-Werkzeugaufruf hat eine leere ID oder Bezeichnung: %@.
es: Llamada de herramienta del Agente tiene ID o nombre vacío: %@.
fr: Appel d'outil Agent avec un ID ou nom vide : %@.
id: Panggilan alat Agent memiliki ID atau nama kosong: %@.
it: Chiamata strumento dell'Agent priva di ID o nome: %@.
ja: エージェント・ツールコールに空の ID または名前があります: %@。
ko: Agent 도구 호출의 ID 또는 이름이 비어 있습니다: %@.
nl: Agent gereedschapsoproep heeft lege ID of naam: %@.
pl: Puste IDlub nazwa narzędzia Agenta: %@.
pt_br: Chamada de ferramenta do Agente possui ID ou nome vazio: %@.
ru: Вызов инструмента Agent имеет пустой ID или имя: %@.
tr: Boş ID veya adı olan Agent araç çağrısı: %@.
uk: Виклик інструменту Ейджента має порожній ID або назву: %@.
vi: Gọi công cụ Agent thiếu ID hoặc tên: %@.
zh_hans: Agent 工具调用的 ID 或名称为空：%@。
zh_hant: Agent 工具呼叫 ID 或名稱為空：%@。

# agent.message.error.mixedRunIDs
source: Agent message history contains multiple run IDs.
ar: تاريخ رسائل الوكيل يحتوي على أكثر من معرف تشغيل واحد.
de: Agentennachrichtenhistorie enthält mehrere Durchgangs-IDs.
es: Historial del mensaje del Agente contiene múltiples IDs de ejecución.
fr: Historique des messages de l'Agent contient plusieurs IDs de session.
id: Riwayat pesan Agent mengandung beberapa ID putaran.
it: Storia dei messaggi dell'Agent contiene più ID esecuzione.
ja: エージェントメッセージ履歴に複数の実行IDが含まれています。
ko: Agent 메시지 기록에 여러 개의 실행 ID가 포함되어 있습니다.
nl: Agent-geschiedenis bevat meerdere run-ID's.
pl: Historia wiadomości Agenta zawiera wiele IDobiegów.
pt_br: Histórico da mensagem do Agente contém múltiplos IDs de execução.
ru: История сообщений Agent содержит несколько идентификаторов выполнения.
tr: Agent mesaj tarihi birden fazla çalışma ID'si içeriyor.
uk: Історія повідомлень Ейджента містить кілька ідентифікаторів виконання.
vi: Lịch sử tin nhắn của Agent chứa nhiều ID chạy khác nhau.
zh_hans: Agent 消息历史包含多个 run ID。
zh_hant: Agent 消息歷史包含多個執行 ID。

# agent.message.error.nonIncreasingSequenceFormat
source: Agent message sequence is not increasing at %d.
ar: ترتيب الرسائل غير متزايد في الخطوة رقم %d.
de: Agentennachrichtensequenz ist nicht steigend bei %d.
es: Secuencia del mensaje del Agente no es creciente en el índice %d.
fr: Séquence du message de l'Agent n'est pas croissante à la position %d.
id: Sekuens pesan Agent tidak bertambah pada %d.
it: Sequenza del messaggio Agent non crescente a %d.
ja: %d でシーケンスが非増加です。
ko: %d번째에서 Agent 메시지 시퀀스가 감소합니다.
nl: Agent-sequentie neemt niet toe bij %d.
pl: Nieprawidłowa sekwencja wiadomości Agenta na pozycji %d.
pt_br: Sequência da mensagem do Agente não está crescente no índice %d.
ru: Последовательность сообщений Agent не возрастает на позиции %d.
tr: Agent mesaj dizisi %d'de artan değil.
uk: Послідовність повідомлення Ейджента не зростає на %d.
vi: Dãy tin nhắn của Agent không tăng dần tại vị trí %d.
zh_hans: Agent 消息 sequence 在 %d 处未递增。
zh_hant: Agent 消息序列於第 %d 處非遞增。

# agent.message.error.toolNameMismatchFormat
source: Agent tool result name does not match call ID: %@.
ar: اسم أداة النتيجة لا يتطابق مع معرف الاستدعاء: %@.
de: Bezeichnung des Agent-Werkzeugrgebnisses passt nicht zur Aufruf-ID: %@.
es: Nombre de la herramienta del resultado no coincide con el ID de llamada: %@.
fr: Nom de l'outil Agent ne correspond pas à l'ID d'appel : %@.
id: Nama hasil alat Agent tidak cocok dengan ID panggilan: %@.
it: Nome dello strumento risultato non corrisponde all'ID chiamata: %@.
ja: ツール結果名とコールIDが一致しません: %@。
ko: Agent 도구 결과 이름이 호출 ID와 일치하지 않습니다: %@.
nl: Naam van het Agent gereedschap resultaat past niet bij oproep-ID: %@.
pl: Nazwa wyniku narzędzia nie pasuje do IDwołania: %@.
pt_br: Nome da ferramenta do resultado do Agente não combina com o ID da chamada: %@.
ru: Имя инструмента в результате не совпадает с ID вызова: %@.
tr: Agent araç sonucu adı çağrı ID'si ile eşleşmiyor: %@.
uk: Назва інструменту результату не відповідає ID виклику: %@.
vi: Tên công cụ kết quả không khớp với ID gọi: %@.
zh_hans: Agent 工具结果名称与调用 ID 不匹配：%@。
zh_hant: Agent 工具結果名稱與呼叫 ID 不符：%@。

# agent.message.error.unknownToolCallFormat
source: Agent tool result references unknown call ID: %@.
ar: نتيجة الأداة تستدعي معرف استدعاء مجهول: %@.
de: Agent-Werkzeugrgebnis verweist auf unbekannte Aufruf-ID: %@.
es: Resultado de la herramienta referencia un ID de llamada desconocido: %@.
fr: Résultat de l'outil fait référence à un ID d'appel inconnu : %@.
id: Hasil alat merujuk ke ID panggilan yang tidak dikenal: %@.
it: Risultato strumento fa riferimento a ID chiamata sconosciuta: %@.
ja: 未知のコールIDを参照するツール結果: %@。
ko: Agent 도구 결과가 알 수 없는 호출 ID를 참조합니다: %@.
nl: Agent gereedschapsresultaat verwijst naar onbekende oproep-ID: %@.
pl: Wynik narzędzia odnosi się do nieznanego IDwołania: %@.
pt_br: Resultado da ferramenta do Agente referencia um ID de chamada desconhecido: %@.
ru: Результат работы инструмента ссылается на неизвестный ID вызова: %@.
tr: Bilinmeyen çağrı ID'sine atıfta bulunan Agent araç sonucu: %@.
uk: Результат інструменту посилається на невідомий ID виклику: %@.
vi: Kết quả công cụ tham chiếu đến ID gọi không tồn tại: %@.
zh_hans: Agent 工具结果引用了未知调用 ID：%@。
zh_hant: Agent 工具結果參考未知呼叫 ID：%@。

# agent.model.error.invalidToolNameFormat
source: The Agent tool name is not provider-compatible: %@
ar: اسم أداة الوكيل غير متوافق مع المورد: %@.
de: Die Bezeichnung des Agent-Werkzeugs ist nicht providerkompatibel: %@
es: El nombre de la herramienta del Agente no es compatible con el proveedor: %@
fr: Le nom de l'outil Agent n'est pas compatible avec le fournisseur : %@
id: Nama alat Agent tidak kompatibel dengan penyedia: %@
it: Il nome dello strumento dell'Agent non è compatibile con il provider: %@
ja: エージェント・ツール名はプロバイダ非互換です: %@。
ko: Agent 도구의 이름은 제공업체에 적합하지 않습니다: %@
nl: De naam van het Agent-gereedschap is niet compatibel met de provider: %@
pl: Nazwa narzędzia Agenta nie jest zgodna z dostawcą: %@
pt_br: O nome da ferramenta do Agente não é compatível com o provedor: %@
ru: Имя инструмента Agent несовместимо с провайдером: %@
tr: Agent araç adı sağlayıcı uyumlu değil: %@
uk: Назва інструменту Ейджента несумісна з провайдером: %@
vi: Tên công cụ Agent không tương thích với nhà cung cấp: %@
zh_hans: Agent 工具名称不符合服务商协议：%@
zh_hant: Agent 工具名稱不符合供應商規範：%@。

# agent.model.error.missingAPIKey
source: Configure the API key for the Agent model first.
ar: يرجى تكوين مفتاح API للموديل الأولًا.
de: Konfigurieren Sie zunächst den API-Schlüssel für das Agentenmodell.
es: Configure primero la clave API para el modelo del Agente.
fr: Configurez d'abord la clé API pour le modèle Agent.
id: Konfigurasi kunci API untuk model Agent terlebih dahulu.
it: Configura prima la chiave API per il modello Agent.
ja: まず、エージェントモデルの API キーを設定してください。
ko: 먼저 Agent 모델의 API 키를 구성하세요.
nl: Configureer eerst de API-sleutel voor het Agent-model.
pl: Konfiguruj klucz API dla modelu Agenta najpierw.
pt_br: Configure a chave API para o modelo do Agente primeiro.
ru: Настройте ключ API для модели Agent сначала.
tr: Önce Agent modeli için API anahtarını yapılandırın.
uk: Конфігуруйте ключ API для моделі Ейджента спочатку.
vi: Hãy cấu hình khóa API cho mô hình Agent trước.
zh_hans: 请先配置 Agent 模型的 API Key。
zh_hant: 請先設定 Agent 模型的 API 金鑰。

# agent.model.error.missingProvider
source: Configure an AI provider for the Agent first.
ar: يرجى تكوين مورد AI للوكلاء أولاً.
de: Konfigurieren Sie zunächst einen KI-Anbieter für den Agenten.
es: Configure un proveedor de IA para el Agente primero.
fr: Configurez un fournisseur IA pour l'Agent en premier.
id: Konfigurasi penyedia AI untuk Agent terlebih dahulu.
it: Configura un fornitore AI per l'Agent prima.
ja: まず、エージェント用の AI プロバイダを設定してください。
ko: 먼저 Agent용 AI 제공자를 구성하세요.
nl: Configureer eerst een AI-provider voor het Agent-model.
pl: Konfiguruj dostawcę AI dla Agenta najpierw.
pt_br: Configure um provedor de IA para o Agente primeiro.
ru: Настройте поставщика AI для Agent сначала.
tr: Önce Agent için bir AI sağlayıcısı yapılandırın.
uk: Конфігуруйте провайдера AI для Ейджента спочатку.
vi: Hãy cấu hình một nhà cung cấp AI cho Agent trước.
zh_hans: 请先为 Agent 配置 AI 服务商。
zh_hant: 請先設定 AI 提供者給 Agent。

# agent.model.error.providerFormat
source: The Agent model request failed: %@
ar: فشل طلب موديل الوكيل: %@.
de: Die Anfrage des Agentenmodells ist fehlgeschlagen: %@
es: La solicitud al modelo del Agente falló: %@
fr: Échec de la requête du modèle Agent : %@
id: Permintaan model Agent gagal: %@
it: La richiesta del modello Agent ha fallito: %@
ja: エージェントモデルリクエストに失敗しました: %@。
ko: Agent 모델 요청이 실패했습니다: %@
nl: De verzoek aan het Agent-model is mislukt: %@
pl: Błąd żądania modelu Agenta: %@
pt_br: A solicitação do modelo do Agente falhou: %@
ru: Запрос к модели Agent завершился неудачно: %@
tr: Agent model isteği başarısız oldu: %@
uk: Запит на модель Ейджента завершився помилкою: %@
vi: Yêu cầu mô hình Agent thất bại: %@
zh_hans: Agent 模型请求失败：%@
zh_hant: Agent 模型要求失敗：%@。
